MikroElektronika/core_packages/ARM/gcc_clang/def/sam/ATSAMD20J14B/mcu.h
/** \addtogroup SAMD20J14B_pio Peripheral Pio Definitions
 *  @{
 */

/* ************************************************************************** */
/*   PIO DEFINITIONS FOR SAMD20J14B                                           */
/* ************************************************************************** */
// Note: Changed for MikroE implementation.
// #include "pio/samd20j14b.h"
/** @}  end of Peripheral Pio Definitions */

/* ************************************************************************** */
/*   MEMORY MAPPING DEFINITIONS FOR SAMD20J14B                                */
/* ************************************************************************** */

#define FLASH_SIZE                     _UL_(0x00004000)    /*   16kB Memory segment type: flash */
#define FLASH_PAGE_SIZE                _UL_(        64)
#define FLASH_NB_OF_PAGES              _UL_(       256)

#define CAL_SIZE                       _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define LOCKBIT_SIZE                   _UL_(0x00000004)    /*    0kB Memory segment type: fuses */
#define OTP1_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP2_SIZE                      _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define OTP4_SIZE                      _UL_(0x000000e0)    /*    0kB Memory segment type: fuses */
#define OTP4_PAGE_SIZE                 _UL_(        64)
#define OTP4_NB_OF_PAGES               _UL_(         3)

#define TEMP_LOG_SIZE                  _UL_(0x00000008)    /*    0kB Memory segment type: fuses */
#define USER_PAGE_SIZE                 _UL_(0x00000100)    /*    0kB Memory segment type: user_page */
#define USER_PAGE_PAGE_SIZE            _UL_(        64)
#define USER_PAGE_NB_OF_PAGES          _UL_(         4)

#define HRAMC0_SIZE                    _UL_(0x00000800)    /*    2kB Memory segment type: ram */
#define HPB0_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB1_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define HPB2_SIZE                      _UL_(0x00010000)    /*   64kB Memory segment type: io */
#define PPB_SIZE                       _UL_(0x00100000)    /* 1024kB Memory segment type: io */
#define SCS_SIZE                       _UL_(0x00001000)    /*    4kB Memory segment type: io */
#define PERIPHERALS_SIZE               _UL_(0x20000000)    /* 524288kB Memory segment type: io */

#define FLASH_ADDR                     _UL_(0x00000000)    /**< FLASH base address (type: flash)*/
#define CAL_ADDR                       _UL_(0x00800000)    /**< CAL base address (type: fuses)*/
#define LOCKBIT_ADDR                   _UL_(0x00802000)    /**< LOCKBIT base address (type: fuses)*/
#define OTP1_ADDR                      _UL_(0x00806000)    /**< OTP1 base address (type: fuses)*/
#define OTP2_ADDR                      _UL_(0x00806008)    /**< OTP2 base address (type: fuses)*/
#define OTP4_ADDR                      _UL_(0x00806020)    /**< OTP4 base address (type: fuses)*/
#define TEMP_LOG_ADDR                  _UL_(0x00806030)    /**< TEMP_LOG base address (type: fuses)*/
#define USER_PAGE_ADDR                 _UL_(0x00804000)    /**< USER_PAGE base address (type: user_page)*/
#define HRAMC0_ADDR                    _UL_(0x20000000)    /**< HRAMC0 base address (type: ram)*/
#define HPB0_ADDR                      _UL_(0x40000000)    /**< HPB0 base address (type: io)*/
#define HPB1_ADDR                      _UL_(0x41000000)    /**< HPB1 base address (type: io)*/
#define HPB2_ADDR                      _UL_(0x42000000)    /**< HPB2 base address (type: io)*/
#define PPB_ADDR                       _UL_(0xe0000000)    /**< PPB base address (type: io)*/
#define SCS_ADDR                       _UL_(0xe000e000)    /**< SCS base address (type: io)*/
#define PERIPHERALS_ADDR               _UL_(0x40000000)    /**< PERIPHERALS base address (type: io)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR SAMD20J14B                                         */
/* ************************************************************************** */
#define DSU_DID                        _UL_(0X10001604)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR SAMD20J14B                                    */
/* ************************************************************************** */

/* ************************************************************************** */
/** Event Generator IDs for SAMD20J14B */
/* ************************************************************************** */
#define EVENT_ID_GEN_RTC_CMP_0                            1 /**< ID for RTC event generator CMP_0 */
#define EVENT_ID_GEN_RTC_CMP_1                            2 /**< ID for RTC event generator CMP_1 */
#define EVENT_ID_GEN_RTC_OVF                              3 /**< ID for RTC event generator OVF */
#define EVENT_ID_GEN_RTC_PER_0                            4 /**< ID for RTC event generator PER_0 */
#define EVENT_ID_GEN_RTC_PER_1                            5 /**< ID for RTC event generator PER_1 */
#define EVENT_ID_GEN_RTC_PER_2                            6 /**< ID for RTC event generator PER_2 */
#define EVENT_ID_GEN_RTC_PER_3                            7 /**< ID for RTC event generator PER_3 */
#define EVENT_ID_GEN_RTC_PER_4                            8 /**< ID for RTC event generator PER_4 */
#define EVENT_ID_GEN_RTC_PER_5                            9 /**< ID for RTC event generator PER_5 */
#define EVENT_ID_GEN_RTC_PER_6                           10 /**< ID for RTC event generator PER_6 */
#define EVENT_ID_GEN_RTC_PER_7                           11 /**< ID for RTC event generator PER_7 */
#define EVENT_ID_GEN_EIC_EXTINT_0                        12 /**< ID for EIC event generator EXTINT_0 */
#define EVENT_ID_GEN_EIC_EXTINT_1                        13 /**< ID for EIC event generator EXTINT_1 */
#define EVENT_ID_GEN_EIC_EXTINT_2                        14 /**< ID for EIC event generator EXTINT_2 */
#define EVENT_ID_GEN_EIC_EXTINT_3                        15 /**< ID for EIC event generator EXTINT_3 */
#define EVENT_ID_GEN_EIC_EXTINT_4                        16 /**< ID for EIC event generator EXTINT_4 */
#define EVENT_ID_GEN_EIC_EXTINT_5                        17 /**< ID for EIC event generator EXTINT_5 */
#define EVENT_ID_GEN_EIC_EXTINT_6                        18 /**< ID for EIC event generator EXTINT_6 */
#define EVENT_ID_GEN_EIC_EXTINT_7                        19 /**< ID for EIC event generator EXTINT_7 */
#define EVENT_ID_GEN_EIC_EXTINT_8                        20 /**< ID for EIC event generator EXTINT_8 */
#define EVENT_ID_GEN_EIC_EXTINT_9                        21 /**< ID for EIC event generator EXTINT_9 */
#define EVENT_ID_GEN_EIC_EXTINT_10                       22 /**< ID for EIC event generator EXTINT_10 */
#define EVENT_ID_GEN_EIC_EXTINT_11                       23 /**< ID for EIC event generator EXTINT_11 */
#define EVENT_ID_GEN_EIC_EXTINT_12                       24 /**< ID for EIC event generator EXTINT_12 */
#define EVENT_ID_GEN_EIC_EXTINT_13                       25 /**< ID for EIC event generator EXTINT_13 */
#define EVENT_ID_GEN_EIC_EXTINT_14                       26 /**< ID for EIC event generator EXTINT_14 */
#define EVENT_ID_GEN_EIC_EXTINT_15                       27 /**< ID for EIC event generator EXTINT_15 */
#define EVENT_ID_GEN_TC0_OVF                             28 /**< ID for TC0 event generator OVF */
#define EVENT_ID_GEN_TC0_MC_0                            29 /**< ID for TC0 event generator MC_0 */
#define EVENT_ID_GEN_TC0_MC_1                            30 /**< ID for TC0 event generator MC_1 */
#define EVENT_ID_GEN_TC1_OVF                             31 /**< ID for TC1 event generator OVF */
#define EVENT_ID_GEN_TC1_MC_0                            32 /**< ID for TC1 event generator MC_0 */
#define EVENT_ID_GEN_TC1_MC_1                            33 /**< ID for TC1 event generator MC_1 */
#define EVENT_ID_GEN_TC2_OVF                             34 /**< ID for TC2 event generator OVF */
#define EVENT_ID_GEN_TC2_MC_0                            35 /**< ID for TC2 event generator MC_0 */
#define EVENT_ID_GEN_TC2_MC_1                            36 /**< ID for TC2 event generator MC_1 */
#define EVENT_ID_GEN_TC3_OVF                             37 /**< ID for TC3 event generator OVF */
#define EVENT_ID_GEN_TC3_MC_0                            38 /**< ID for TC3 event generator MC_0 */
#define EVENT_ID_GEN_TC3_MC_1                            39 /**< ID for TC3 event generator MC_1 */
#define EVENT_ID_GEN_TC4_OVF                             40 /**< ID for TC4 event generator OVF */
#define EVENT_ID_GEN_TC4_MC_0                            41 /**< ID for TC4 event generator MC_0 */
#define EVENT_ID_GEN_TC4_MC_1                            42 /**< ID for TC4 event generator MC_1 */
#define EVENT_ID_GEN_TC5_OVF                             43 /**< ID for TC5 event generator OVF */
#define EVENT_ID_GEN_TC5_MC_0                            44 /**< ID for TC5 event generator MC_0 */
#define EVENT_ID_GEN_TC5_MC_1                            45 /**< ID for TC5 event generator MC_1 */
#define EVENT_ID_GEN_TC6_OVF                             46 /**< ID for TC6 event generator OVF */
#define EVENT_ID_GEN_TC6_MC_0                            47 /**< ID for TC6 event generator MC_0 */
#define EVENT_ID_GEN_TC6_MC_1                            48 /**< ID for TC6 event generator MC_1 */
#define EVENT_ID_GEN_TC7_OVF                             49 /**< ID for TC7 event generator OVF */
#define EVENT_ID_GEN_TC7_MC_0                            50 /**< ID for TC7 event generator MC_0 */
#define EVENT_ID_GEN_TC7_MC_1                            51 /**< ID for TC7 event generator MC_1 */
#define EVENT_ID_GEN_ADC_RESRDY                          52 /**< ID for ADC event generator RESRDY */
#define EVENT_ID_GEN_ADC_WINMON                          53 /**< ID for ADC event generator WINMON */
#define EVENT_ID_GEN_AC_COMP_0                           54 /**< ID for AC event generator COMP_0 */
#define EVENT_ID_GEN_AC_COMP_1                           55 /**< ID for AC event generator COMP_1 */
#define EVENT_ID_GEN_AC_WIN_0                            56 /**< ID for AC event generator WIN_0 */
#define EVENT_ID_GEN_DAC_EMPTY                           57 /**< ID for DAC event generator EMPTY */

/* ************************************************************************** */
/** Event User IDs for SAMD20J14B */
/* ************************************************************************** */
#define EVENT_ID_USER_TC0_EVU                             0 /**< ID for TC0 event user EVU */
#define EVENT_ID_USER_TC1_EVU                             1 /**< ID for TC1 event user EVU */
#define EVENT_ID_USER_TC2_EVU                             2 /**< ID for TC2 event user EVU */
#define EVENT_ID_USER_TC3_EVU                             3 /**< ID for TC3 event user EVU */
#define EVENT_ID_USER_TC4_EVU                             4 /**< ID for TC4 event user EVU */
#define EVENT_ID_USER_TC5_EVU                             5 /**< ID for TC5 event user EVU */
#define EVENT_ID_USER_TC6_EVU                             6 /**< ID for TC6 event user EVU */
#define EVENT_ID_USER_TC7_EVU                             7 /**< ID for TC7 event user EVU */
#define EVENT_ID_USER_ADC_START                           8 /**< ID for ADC event user START */
#define EVENT_ID_USER_ADC_SYNC                            9 /**< ID for ADC event user SYNC */
#define EVENT_ID_USER_AC_SOC_0                           10 /**< ID for AC event user SOC_0 */
#define EVENT_ID_USER_AC_SOC_1                           11 /**< ID for AC event user SOC_1 */
#define EVENT_ID_USER_DAC_START                          12 /**< ID for DAC event user START */

#ifdef __cplusplus
}
#endif

/** @}  end of SAMD20J14B definitions */


#endif /* _SAMD20J14B_H_ */

